app/Helpers/db_helper.php

SELECT *
FROM `tb_identitas`
WHERE `id` = '1'
---
    function get_identitas($field)
    {
        $db = \Config\Database::connect();

        $query = $db->table('tb_identitas');
        $query->select('*');
        $query->where('id', '1');
        $result = $query->get()->getRow();

SELECT *
FROM `tb_users`
WHERE `id` = '1'
---
    function get_user($id)
    {
        $db = \Config\Database::connect();

        $query = $db->table('tb_users');
        $query->select('*');
        $query->where('id', text_dekripsi($id));
        $result = $query->get()->getRow();