app/Models/JamKerjaModel.php

    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_jamkerja`

    public function countAll()
    {
        $tbl_storage = $this->dt;
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_jamkerja`