app/Models/LogsModel.php

INSERT INTO `logs` (`aksi`, `keterangan`, `created_at`) VALUES ('Login', 'Berhasil login ke aplikasi 1', '2023-12-08 17:53:47')
---
    public function adddata($data)
    {
        $execute = $this->dt->insert($data);