app/Models/PegawaiModel.php

SELECT *
FROM `tb_pegawai`
ORDER BY `id` DESC
 LIMIT 10
---
    public function getDatatables()
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->get();

SELECT COUNT(*) AS `numrows`
FROM `tb_pegawai`
---
    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_pegawai`
---
    public function countAll()
    {
        $tbl_storage = $this->dt;
        return $tbl_storage->countAllResults();